import { Link } from 'react-router';

const State = () => {
  return (
    <div>
      <h1>State</h1>
      <p>
        {' '}
        <span className="red-line">При</span> разработке приложений состояние{' '}
        <span className="text-red-600">(state)</span> играет важную роль. Оно
        представляет собой данные, которые используются внутри компонента для
        отслеживания и обновления информации. Состояние позволяет компонентам
        быть динамичными и реагировать на изменения данных или взаимодействие
        пользователя. Простыми словами, это то, что <b>ИЗМЕНЯЕТСЯ</b> в
        компоненте, нежели props-ы которые неизменны
      </p>
      <p>
        В React есть возможность использовать state в функциональных
        компонентах, путем использования хука{' '}
        <span className="text-red-500">useState.</span>
      </p>
      <p>
        💡 Хук (hook) в React — это специальная функция, которая позволяет
        "подключаться" к возможностям React из функциональных компонентов.
      </p>
      <pre>
        <code>{`import React, { useState } from 'react';

const [state, setState] = useState(initialState);`}</code>
      </pre>

      <p>
        <span className="red-line text-red-500">Хук useState</span> позволяет
        функциональным компонентам в React добавлять локальное состояние.
      </p>
      <p>
        Он возвращает массив с парой значений: [текущее значение состояния,
        функцию для его обновления]. При вызове функции обновления, React
        перерисует компонент с новым значением состояния.{' '}
      </p>

      <p>
        <mark>state:</mark> текущее значение состояния.
      </p>
      <p>
        <mark>setState:</mark> функция для обновления значения состояния.
      </p>
      <p>
        <mark>initialState :</mark> (необязательный): начальное значение
        состояния. Может быть примитивным типом данных, объектом или функцией.
      </p>

      <h2>Создание state</h2>

      <pre>
        <code>{`import React, { useState } from 'react';

const Counter = () => {
  const [count, setCount] = useState(0);

  // Остальной код компонента
};`}</code>
      </pre>

      <h2>Обновление состояния</h2>
      <p>
        Для обновления состояния в функциональных компонентах используется
        функция <span className="text-red-500">setCount</span>, которая является
        вторым элементом массива, возвращаемого{' '}
        <span className="text-red-500">useState</span>. При вызове{' '}
        <span className="text-red-500">setCount</span> передается новое значение
        состояния или функция. Когда новое состояние зависит от предыдущего, то
        лучше использовать функциональное обновление.
      </p>

      <pre>
        <code>{`const Counter = () => {
  const [count, setCount] = useState(0);

  const increment = () => {
    setCount(count => count + 1);
  };

  // Остальной код компонента
};`}</code>
      </pre>
      <p>
        React автоматически обновит компонент и перерисует его с новым значением
        состояния
      </p>

      <p>🤩 State можно передавать в дочерние компоненты при помощи props.</p>
      <div className="pt-5">
        <Link className="next-page" to={'/book/props'}>
          &larr; Props
        </Link>
        <Link className="next-page" to={'/book/components'}>
          В начало
        </Link>
        <Link className="next-page" to={'/book/lifecycle'}>
          LifeCycle &rarr;
        </Link>
      </div>
    </div>
  );
};

export default State;
